In [1]:
import pandas as pd

In [10]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=["A","B","Z"])

In [11]:
df.head()

   A  B  Z
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
values = pd.DataFrame([[10,20,30],[100,200,300]], columns=["w","z","y"])

In [22]:
values

     w    z    y
0   10   20   30
1  100  200  300

In [24]:
values.head()

     w    z    y
0   10   20   30
1  100  200  300

In [28]:
arr = ["A","B","C"]

pd.Series(arr)

0    A
1    B
2    C
dtype: object

In [30]:
data = {'One': [1,2,3], 'Two': [4,5,6], 'Three':[7,8,9] }

df = pd.DataFrame(data)

In [34]:
data

{'One': [1, 2, 3], 'Two': [4, 5, 6], 'Three': [7, 8, 9]}

ser = pd.Series([0,2,3], index=["A","B","C"])

df = pd.DataFrame(data=ser, index=["two"])

print(df)

In [41]:
array = {'Nome':["Marcos", "Ana", "Lucas"], 'Age':[20,10,30]}

df = pd.DataFrame(data=array)

In [42]:
df

     Nome  Age
0  Marcos   20
1     Ana   10
2   Lucas   30

In [46]:
df.iloc[0]

Nome    Marcos
Age         20
Name: 0, dtype: object